export function AboutSection() {
  return (
    <section className="text-center lg:px-50 max-lg:px-10 py-20 space-y-6">
      <h2>על עצמי</h2>
      <p>
        קרן פרגו ילידת 1975, חיה ויוצרת בקיבוץ מעין צבי. בוגרת לימודי עיצוב תעשייתי ואמנות ב-HIT
2002. לימודים עצמאיים שונים בתחום התפירה והתדמיתנות. עוסקת בעיקר ברישום על גבי מצע
של ניירות “רדי מייד” שונים.עבודותיה של קרן פרגו מורכבות מרקע של דפי “רדי מייד” מספרים ישנים שונים ומעליהם רישום
קווי-לירי בעיקר של מוטיבים מן החי והצומח. מדובר בעיקר בספרים מהמאה הקודמת שהודפסו
על גבי סוגי נייר שונים ובטכניקת דפוס שונות, אלו ספרים שמספרים את סיפורה של ראשית
ההתיישבות היהודית בישראל לצד סיפורים אישיים של משפחות רבות. הדימויים המצוירים והאופן
שבו הם מצוירים נובעים מתוך קשר ישיר למצע הטקסטואלי שעל גביו הם נוצרים, זהו קשר
קונספטואלי ורגשי גם יחד.
      </p>
      <button className="bg-black text-[12px] text-white px-6 py-3 rounded-md hover:opacity-80 transition cursor-pointer">
        לפרטים נוספים
      </button>
    </section>
  );
}